; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_4 ?v1 - type_3 ?v6 - type_2)
 	      (pred_2 ?v3 - object ?v6 - type_2)
	      (pred_1 ?v1 - type_3 ?v5 - type_1)
	      (pred_3 ?v1 - type_3 ?v3 - object ?v5 - type_1))

   (:action op_3
       :parameters  (?v1 - type_3 ?v8 ?v4 - type_2)
       :precondition (and  (pred_4 ?v1 ?v8))
       :effect (and  (pred_4 ?v1 ?v4)
		     (not (pred_4 ?v1 ?v8))))

   (:action op_1
       :parameters (?v1 - type_3 ?v2 - object ?v7 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_2 ?v2 ?v7) (pred_4 ?v1 ?v7) (pred_1 ?v1 ?v5))
       :effect (and (pred_3 ?v1 ?v2 ?v5)
		    (not (pred_2 ?v2 ?v7)) 
		    (not (pred_1 ?v1 ?v5))))

   (:action op_2
       :parameters (?v1 - type_3 ?v2 - object ?v7 - type_2 ?v5 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v2 ?v5) (pred_4 ?v1 ?v7))
       :effect (and (pred_2 ?v2 ?v7)
		    (pred_1 ?v1 ?v5)
		    (not (pred_3 ?v1 ?v2 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_13 obj_06 - type_3
obj_07 obj_09 obj_03 obj_04 - type_1
obj_08 obj_02 obj_10 obj_05 - type_2
obj_01 obj_11 obj_12 obj_14 - object)
(:init
(pred_4 obj_13 obj_05)
(pred_1 obj_13 obj_07)
(pred_1 obj_13 obj_09)
(pred_4 obj_06 obj_10)
(pred_1 obj_06 obj_03)
(pred_1 obj_06 obj_04)
(pred_2 obj_01 obj_02)
(pred_2 obj_11 obj_08)
(pred_2 obj_12 obj_05)
(pred_2 obj_14 obj_02)
)
(:goal
(and
(pred_2 obj_01 obj_10)
(pred_2 obj_11 obj_10)
(pred_2 obj_12 obj_08)
(pred_2 obj_14 obj_08)
)
)

(:constraints
  (and
    (always (not (and (pred_4 obj_13 obj_08) (pred_4 obj_06 obj_08))))
    (always (not (and (pred_4 obj_13 obj_02) (pred_4 obj_06 obj_02))))
  )
)
)

; plan
1. (op_1 obj_13 obj_12 obj_05 obj_09)
   deleted: (pred_2 obj_12 obj_05) (pred_1 obj_13 obj_09)
   added: (pred_3 obj_13 obj_12 obj_09)
   goals met: 0 of 4
2. (op_3 obj_06 obj_10 obj_02)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_02)
   goals met: 0 of 4
3. (op_3 obj_13 obj_05 obj_08)
   deleted: (pred_4 obj_13 obj_05)
   added: (pred_4 obj_13 obj_08)
   goals met: 0 of 4
4. (op_1 obj_06 obj_14 obj_02 obj_04)
   deleted: (pred_2 obj_14 obj_02) (pred_1 obj_06 obj_04)
   added: (pred_3 obj_06 obj_14 obj_04)
   goals met: 0 of 4
5. (op_1 obj_06 obj_01 obj_02 obj_03)
   deleted: (pred_2 obj_01 obj_02) (pred_1 obj_06 obj_03)
   added: (pred_3 obj_06 obj_01 obj_03)
   goals met: 0 of 4
6. (op_2 obj_13 obj_12 obj_08 obj_09)
   deleted: (pred_3 obj_13 obj_12 obj_09)
   added: (pred_2 obj_12 obj_08) (pred_1 obj_13 obj_09)
   goals met: 1 of 4
7. (op_3 obj_06 obj_02 obj_10)
   deleted: (pred_4 obj_06 obj_02)
   added: (pred_4 obj_06 obj_10)
   goals met: 1 of 4
8. (op_1 obj_13 obj_11 obj_08 obj_07)
   deleted: (pred_2 obj_11 obj_08) (pred_1 obj_13 obj_07)
   added: (pred_3 obj_13 obj_11 obj_07)
   goals met: 1 of 4
9. (op_3 obj_13 obj_08 obj_10)
   deleted: (pred_4 obj_13 obj_08)
   added: (pred_4 obj_13 obj_10)
   goals met: 1 of 4
10. (op_2 obj_06 obj_01 obj_10 obj_03)
   deleted: (pred_3 obj_06 obj_01 obj_03)
   added: (pred_2 obj_01 obj_10) (pred_1 obj_06 obj_03)
   goals met: 2 of 4
11. (op_3 obj_06 obj_10 obj_08)
   deleted: (pred_4 obj_06 obj_10)
   added: (pred_4 obj_06 obj_08)
   goals met: 2 of 4
12. (op_2 obj_13 obj_11 obj_10 obj_07)
   deleted: (pred_3 obj_13 obj_11 obj_07)
   added: (pred_2 obj_11 obj_10) (pred_1 obj_13 obj_07)
   goals met: 3 of 4
13. (op_2 obj_06 obj_14 obj_08 obj_04)
   deleted: (pred_3 obj_06 obj_14 obj_04)
   added: (pred_2 obj_14 obj_08) (pred_1 obj_06 obj_04)
   goals met: 4 of 4
